tap "colindean/fonts-nonfree"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "muesli/tap"
tap "profclems/tap"
tap "srkomodo/tap"
tap "universal-ctags/universal-ctags"
tap "wfxr/code-minimap"
brew "bandwhich"
brew "bash"
brew "bat"
brew "pkg-config"
brew "broot"
brew "xz"
brew "cmake"
brew "python@3.10"
brew "codespell"
brew "coreutils"
brew "ctop"
brew "diff-so-fancy"
brew "dog"
brew "dust"
brew "eslint"
brew "exa"
brew "fd"
brew "zeromq"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gd"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "gnu-sed"
brew "go"
brew "hadolint"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "hub"
brew "imagemagick@6"
brew "jq"
brew "less"
brew "lf"
brew "libmagic"
brew "lsd"
brew "lua@5.1", link: false
brew "luarocks"
brew "make"
brew "markdownlint-cli"
brew "mkcert"
brew "mosh"
brew "msgpack"
brew "mtr"
brew "multitail"
brew "mutt"
brew "mysql@5.7"
brew "neovim"
brew "nnn"
brew "node@14"
brew "openapi-generator"
brew "openvpn"
brew "perl-build"
brew "pigz"
brew "plenv"
brew "pre-commit"
brew "procs"
brew "ranger"
brew "restview"
brew "ripgrep"
brew "rust"
brew "selene"
brew "shellcheck"
brew "shfmt"
brew "sql-lint"
brew "tealdeer"
brew "telnet"
brew "thefuck"
brew "tidyp"
brew "tig"
brew "tmux"
brew "tokei"
brew "urlview"
brew "w3m"
brew "wget"
brew "yamllint"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "zsh-git-prompt"
brew "muesli/tap/duf"
brew "profclems/tap/glab"
brew "srkomodo/tap/shadowfox-updater"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "wfxr/code-minimap/code-minimap"
cask "1password"
cask "alfred"
cask "android-platform-tools"
cask "barrier"
cask "browserosaurus"
cask "burp-suite"
cask "cheatsheet"
cask "clementine"
cask "cyberduck"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "eloston-chromium"
cask "firefox"
cask "flux"
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-microsoft-office"
cask "google-chrome"
cask "iina"
cask "iterm2"
cask "karabiner-elements"
cask "kitty"
cask "logitech-presentation"
cask "maccy"
cask "microsoft-auto-update"
cask "microsoft-powerpoint"
cask "openinterminal-lite"
cask "plex"
cask "plex-media-player"
cask "sensiblesidebuttons"
cask "sequel-pro"
cask "signal"
cask "skype"
cask "slack"
cask "spotify"
cask "teamviewer"
cask "the-unarchiver"
cask "transmission"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "wireshark"
cask "xquartz"
cask "xrg"
cask "zoom"
