tap "anomalyco/tap", "https://github.com/anomalyco/homebrew-tap.git"
tap "chase/tap"
tap "common-fate/granted"
tap "dimentium/autoraise"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "hougesen/tap"
tap "iina/mpv-iina"
tap "louisbrunner/valgrind", "https://github.com/LouisBrunner/homebrew-valgrind"
tap "netmute/tap"
tap "nikitabobko/tap"
tap "tako8ki/tap"
tap "tonisives/tap"
# Highly capable, feature-rich programming language
brew "perl"
# Better CD Encoder
brew "abcde"
# Vector graphics library with cross-device output support
brew "cairo"
# Framework for layout and rendering of i18n text
brew "pango"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Read CD and get CDDB discid information
brew "cd-discid"
# Python character encoding detector
brew "chardet", link: false
# Cross-platform make
brew "cmake"
# Fix common misspellings in source code and text files
brew "codespell"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Maintained ctags implementation
brew "universal-ctags"
# LSP implementation using universal-ctags as backend
brew "ctags-lsp"
# Dockerfile format and parser. a modern dockfmt
brew "dockerfmt"
# Text processing system for reStructuredText
brew "docutils"
# Command-line DNS Client for Humans
brew "doggo"
# Pluggable and configurable code formatting platform written in Rust
brew "dprint"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# AV1 encoder
brew "svt-av1"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# New file format for still image compression
brew "jpeg-xl"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Open-source GitLab command-line tool
brew "glab"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Reliable, high performance TCP/HTTP load balancer
brew "haproxy"
# Kubernetes package manager
brew "helm"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Convert HTML to PDF or PostScript
brew "htmldoc"
# Improved top (interactive process viewer)
brew "htop"
# Apache HTTP server
brew "httpd"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Copy/paste detector for programming source code
brew "jscpd"
# JSON parser and validator with a CLI
brew "jsonlint"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Cross-platform TUI database management tool
brew "lazysql"
# Implementation of the file(1) command
brew "libmagic"
# Lynx-like WWW browser that supports tables, menus, etc.
brew "links"
# Text-based web browser
brew "lynx"
# Web and API based SMTP testing tool
brew "mailhog"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Mongrel of mail user agents (part elm, pine, mush, mh, etc.)
brew "mutt"
# Open source relational database management system
brew "mysql@8.4"
# NCurses Disk Usage
brew "ncdu"
# E-mail reader with support for Notmuch, NNTP and much more
brew "neomutt"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Graphical client for the Soulseek peer-to-peer network
brew "nicotine-plus"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl builder
brew "perl-build"
# Parallel gzip
brew "pigz"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Perl binary manager
brew "plenv"
# Paste PNG into files
brew "pngpaste"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Prettier daemon
brew "prettierd"
# Monitor data's progress through a pipe
brew "pv"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Convert character set (charsets)
brew "recode"
# Persistent key-value database, with built-in net interface
brew "redis"
# SVG rendering tool and library
brew "resvg"
# Utility that provides fast incremental file transfer
brew "rsync"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Bash syntax highlighter that encourages/fixes variables quoting
brew "shellharden"
# Autoformat shell script source code
brew "shfmt"
# Multi-purpose tool for manipulating and analyzing WAV files
brew "shntool"
# Whitespace formatter for different query languages
brew "sql-formatter"
# SQL linter to do sanity checks on your queries and bring errors back from the DB
brew "sql-lint"
# Non-interactive SSH password auth
brew "sshpass"
# Opinionated Lua code formatter
brew "stylua"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Programmatically correct mistyped console commands
brew "thefuck"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Source code spell checker
brew "typos-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Pager/text based browser
brew "w3m"
# Convert HTML to PDF
brew "weasyprint"
# Internet file retriever
brew "wget"
# HTTP benchmarking tool
brew "wrk"
# Extensible command-line tool to format YAML files
brew "yamlfmt"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# High-performance, asynchronous messaging library
brew "zeromq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Android SDK component
cask "android-platform-tools"
# Music player and library organiser
cask "clementine"
# Preference Pane for controlling cursor hiding
cask "cursorcerer"
# Monitoring and security across systems, apps, and services
cask "datadog-agent"
# Disk usage utility
cask "disk-inventory-x"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
cask "font-inconsolata"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Go (golang) IDE
cask "goland"
# Web browser
cask "google-chrome"
# Utility to hide menu bar items
cask "hiddenbar"
# Download manager
cask "jdownloader"
# Keyboard customiser
cask "karabiner-elements"
# Audio tagger focusing on efficiency
cask "kid3"
# Video format converter (transcoder)
cask "makemkv"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Unofficial desktop client for F1 TV
cask "multiviewer"
# Music player
cask "museeks"
# Music tagger
cask "musicbrainz-picard"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# System-wide Vim mode for macOS
cask "tonisives/tap/ovim"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# Convert HTML to PDF
cask "prince"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Unpacks archive files
cask "the-unarchiver"
# Multimedia player
cask "vlc"
# Create, manage, and run virtual machines
cask "vmware-fusion"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Lossless audio decoder
cask "xld"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
go "golang.org/x/tools/cmd/auth/authtest"
go "golang.org/x/tools/cmd/benchcmp"
go "golang.org/x/tools/cmd/bisect"
go "golang.org/x/tools/cmd/bundle"
go "golang.org/x/tools/cmd/callgraph"
go "golang.org/x/tools/internal/mcp/internal/readme/client"
go "golang.org/x/tools/cmd/compilebench"
go "golang.org/x/tools/cmd/auth/cookieauth"
go "golang.org/x/tools/cmd/deadcode"
go "golang.org/x/tools/go/analysis/passes/defers/cmd/defers"
go "golang.org/x/tools/cmd/digraph"
go "golang.org/x/tools/cmd/eg"
go "golang.org/x/tools/go/analysis/passes/fieldalignment/cmd/fieldalignment"
go "golang.org/x/tools/cmd/file2fuzz"
go "golang.org/x/tools/go/analysis/passes/findcall/cmd/findcall"
go "golang.org/x/tools/cmd/fiximports"
go "golang.org/x/tools/cmd/signature-fuzzer/fuzz-driver"
go "golang.org/x/tools/cmd/signature-fuzzer/fuzz-runner"
go "golang.org/x/tools/cmd/getgo"
go "golang.org/x/tools/cmd/auth/gitauth"
go "golang.org/x/tools/cmd/go-contrib-init"
go "golang.org/x/tools/cmd/godex"
go "golang.org/x/tools/cmd/godoc"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "github.com/nametake/golangci-lint-langserver"
go "github.com/segmentio/golines"
go "golang.org/x/tools/internal/modindex/gomodindex"
go "golang.org/x/tools/cmd/gomvpkg"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/go/packages/gopackages"
go "golang.org/x/tools/cmd/gorename"
go "golang.org/x/tools/internal/stack/gostacks"
go "golang.org/x/tools/cmd/gotype"
go "golang.org/x/tools/cmd/goyacc"
go "golang.org/x/tools/cmd/guru"
go "golang.org/x/tools/internal/mcp/examples/hello"
go "golang.org/x/tools/cmd/html2article"
go "golang.org/x/tools/go/analysis/passes/httpmux/cmd/httpmux"
go "golang.org/x/tools/go/analysis/passes/ifaceassert/cmd/ifaceassert"
go "golang.org/x/tools/go/analysis/passes/inline/cmd/inline"
go "golang.org/x/tools/go/packages/internal/linecount"
go "golang.org/x/tools/go/analysis/passes/lostcancel/cmd/lostcancel"
go "github.com/client9/misspell/cmd/misspell"
go "git.perceptyx.com/lhub/mockserver/cmd/mockserver"
go "golang.org/x/tools/go/analysis/passes/modernize/cmd/modernize"
go "golang.org/x/tools/cmd/auth/netrcauth"
go "golang.org/x/tools/go/analysis/passes/nilness/cmd/nilness"
go "golang.org/x/tools/go/packages/internal/nodecount"
go "golang.org/x/tools/go/types/internal/play"
go "golang.org/x/tools/cmd/present"
go "golang.org/x/tools/cmd/present2md"
go "golang.org/x/tools/go/analysis/passes/reflectvaluecompare/cmd/reflectvaluecompare"
go "golang.org/x/tools/internal/mcp/internal/readme/server"
go "golang.org/x/tools/go/analysis/passes/shadow/cmd/shadow"
go "golang.org/x/tools/cmd/splitdwarf"
go "golang.org/x/tools/cmd/ssadump"
go "golang.org/x/tools/internal/mcp/examples/sse"
go "golang.org/x/tools/cmd/stress"
go "golang.org/x/tools/cmd/stringer"
go "golang.org/x/tools/go/analysis/passes/stringintconv/cmd/stringintconv"
go "golang.org/x/tools/cmd/toolstash"
go "golang.org/x/tools/go/analysis/passes/unmarshal/cmd/unmarshal"
go "golang.org/x/tools/go/analysis/passes/unusedresult/cmd/unusedresult"
cargo "devicon-lookup"
uv "-"
uv "-"
uv "-"
uv "aider-chat", with: ["pip"]
uv "vectorcode[lsp,mcp]"
npm "@google/gemini-cli"
npm "@openai/codex"
npm "@stoplight/spectral-cli"
npm "corepack"
npm "fixjson"
npm "mcp-hub"
npm "perlnavigator-server"
