tap "chase/tap"
tap "common-fate/granted"
tap "dimentium/autoraise"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "netmute/tap"
tap "nikitabobko/tap"
tap "tako8ki/tap"
brew "perl"
brew "abcde"
brew "cairo"
brew "pango"
brew "ansifilter"
brew "jpeg-xl"
brew "aws-vault"
brew "awscli"
brew "bash"
brew "bat"
brew "block-goose-cli"
brew "cd-discid"
brew "chardet", link: false
brew "claude-squad"
brew "cmake"
brew "codespell"
brew "coreutils"
brew "docutils"
brew "dprint"
brew "node"
brew "eslint"
brew "eza"
brew "fd"
brew "svt-av1"
brew "zeromq"
brew "ffmpeg"
brew "fzf"
brew "gd"
brew "gh"
brew "git"
brew "git-delta"
brew "git-filter-repo"
brew "glab"
brew "glances"
brew "gnu-sed"
brew "go"
brew "pkgconf"
brew "hadolint"
brew "helm"
brew "htop"
brew "imagemagick"
brew "jira-cli"
brew "jj"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "lazysql"
brew "libmagic"
brew "links"
brew "lynx"
brew "markdownlint-cli"
brew "mas"
brew "mdformat"
brew "mkcert"
brew "multitail"
brew "mutt"
brew "mysql@8.4"
brew "ncdu"
brew "neovim"
brew "neovide"
brew "python-setuptools"
brew "nicotine-plus"
brew "nvm"
brew "ollama"
brew "openvpn"
brew "pandoc"
brew "perl-build"
brew "pigz"
brew "plenv"
brew "pngpaste"
brew "poppler"
brew "pre-commit"
brew "pyenv"
brew "pyenv-virtualenv"
brew "recode"
brew "redis"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "shellcheck"
brew "shfmt"
brew "shntool"
brew "sql-lint"
brew "sshpass"
brew "stylua"
brew "telnet"
brew "tfenv"
brew "thefuck"
brew "tidy-html5"
brew "tig"
brew "tldr"
brew "tmux"
brew "typos-cli"
brew "universal-ctags"
brew "uv"
brew "wget"
brew "yamllint"
brew "yarn"
brew "yazi"
brew "yq"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "chase/tap/awrit"
brew "common-fate/granted/granted"
brew "dimentium/autoraise/autoraise", args: ["with-dold_activation_method"]
brew "felixkratz/formulae/borders"
brew "netmute/tap/ctags-lsp"
brew "tako8ki/tap/gobang"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "clementine"
cask "cursorcerer"
cask "disk-inventory-x"
cask "dropbox"
cask "firefox"
cask "font-inconsolata"
cask "ghostty@tip"
cask "goland"
cask "google-chrome"
cask "hiddenbar"
cask "jdownloader"
cask "karabiner-elements"
cask "kid3"
cask "makemkv"
cask "microsoft-auto-update"
cask "multiviewer-for-f1"
cask "museeks"
cask "musicbrainz-picard"
cask "nextcloud"
cask "nuclear"
cask "plex"
cask "plexamp"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "signal"
cask "skype"
cask "slack"
cask "spotify"
cask "stats"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "wezterm"
cask "xld"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Tailscale", id: 1475387142
vscode "bscan.perlnavigator"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "vscodevim.vim"
